package lesson6;

/*
Создать свое собственное исключение: класс InputNotPositiveException, наследник InputMismatchException
Внутри класса с помощью генерации кода добавить пустой конструктор

В psvm добавить код из HW4, но после считывания x и y из консоли добавить код,
проверяющий является ли хотя бы один из них числом <= 0
Если да, то бросить (ключевое слово throw) новое исключение InputNotPositiveException
Добавить ещё один блок catch, который должен обработать это исключение
  и вывести пользователю строку "Вы ввели неположительное число, попробуйте снова"
 */
public class HW5 {

  public static void main(String[] args) {

  }
}
