package lesson3;

/*
Внутри класса HW2 создать три метода:
метод add, который принимает два целых числа как аргументы и возвращает их сумму
метод prod, который принимает два целых числа как аргументы и возвращает их произведение
метод negative, который принимает целое число и возвращает его же, умноженное на -1 (то есть меняет знак)
в psvm спросить у пользователя три числа a, b, c
и с помощью методов add, prod и negative вывести в консоль результат выражения -c * (a + b)
P.S. Внутри sout можно пользоваться только методами, операциями "+", "*" и "-" нельзя
 */
public class HW2 {
  public static void main(String[] args) {

  }
}
