package lesson4;

/*
Спросить у пользователя строку с помощью метода nextLine() у сканера
С помощью методов получившейся строки вывести на экран встречается ли строка "привет" внутри введенной строки
Если встречается, то вывести информацию о том, встречается она один раз или несколько
Пример:
При вводе "изучаем методы и классы Java" должно выводить "Слово 'привет' не встречается"
"привет, изучаем методы и классы Java" должно выводить "Слово 'привет' встречается единожды"
"привет, привет, изучаем методы и классы Java" должно выводить "Слово 'привет' встречается больше 1 раза"
 */
public class HW5 {

  public static void main(String[] args) {

  }
}
