package lesson7;

/*
Создать текстовый файл hw12.txt со смешанным содержанием (цифры, буквы разных алфавитов, спецсимволы)
С помощью потоков байт FileInputStream и FileOutputStream создать копию этого файла hw12_copy.txt
В время копирования подсчитать количество операций копирования байта
(т.е. подсчитать размер исходного файла в байтах)
После копирования вывести фразу "Файл скопирован, всего скопировано %d байт"
В случае любой ошибки чтения/записи (IOException) вывести "Ошибка чтения/записи"
 */
public class HW1 {

  public static void main(String[] args) {

  }

}
