package lesson7;

/*
Создать файл numbers.txt, в котором должен быть набор чисел (целых и дробных),
разделенных пробельными символами (пробелы/табуляции/новые строки)
С помощью Scanner и FileInputStream прочесть все числа из файла
и вывести их среднее арифметическое с тремя знаками после запятой, используя System.out.printf
P.S. В файле могут встретиться не числа, их нужно пропустить
Пример входного файла
" 1 2,5 -2 asd 43e
hhf 6,5"
Результат операции в консоли: 2.000
 */
public class HW3 {

  public static void main(String[] args) {

  }
}
